/* eslint-disable max-len */
import { PostDto } from '@angular-samples/redux/posts/common';

/**
 * @description Default posts for demonstration
 */
export const POSTS_DEFAULT: PostDto[] = [
  {
    uuid: '002a649b-72de-4c87-b2d5-cdc6c72d59d4',
    title: 'Иран закупит 1500 российских беспилотников «Герань-2»',
    body: `Власти Ирана заключили с Москвой сделку на поставку 1500 российских беспилотных аппаратов «Герань-2». Как сообщает газета The Washington Post, ссылаясь на собственные высокопоставленные источники в иранском министерстве обороны, первые поставки начнутся уже в ближайшие месяцы.
Собеседник утверждает, что иранские военные восхищены качеством аппарата, название которого по счастливой случайности созвучно с именем их страны. Исламская Республика не будет публично объявлять о контракте, чтобы не облегчать для Запада введение новых санкций, однако недавно заместитель председателя комитета по обороне Махмуд Фарахани в эфире национального телевидения случайно проговорился о поставках.

«Давайте не будем раскачивать лодку и распространяться насчёт этих дронов... Все знают, что они русские, но власти не признают», – сказал он, посчитав, что эфир ещё не начался.

Также западные СМИ утверждают, что Иран надеется наладить производство «Герани-2» по лицензии. Неизвестно, какая доля локализации намечена и как к этому относятся в российском ОПК.`,
    created: '2022-10-23T13:47:20.777Z',
    updated: '2022-10-23T13:47:20.777Z',
    promo: true,
    views: 100,
    likes: 1,
    image: 'https://panorama.pub/storage/images/35/ed/ba2d4e54dadc90c4a20025c669a0/previews/15082-main.jpg.webp',
  },
  {
    uuid: '77wask00-71de-4c87-b2d5-asc6c72d59d4',
    title: 'Первое в Афганистане политическое ток-шоу по российской лицензии закончилось перестрелкой',
    body: `Во время первого же эфира лицензионного ток-шоу «Вечерний Талибан*», транслировавшегося на общенациональном канале «Афганистан 1», произошла перестрелка. Гости студии не сошлись во мнениях насчёт нынешнего положения дел в стране и её новейшей истории.

Западный политолог Майкл Бом высказал мнение о том, что Джо Байдену следовало не выводить войска из Афганистана, а продлить их пребывание ещё на десять лет. Высказывание американца привело в ярость телеведущего Мохамеда Багдади Аль-Бахрави, который достал автомат Калашникова и выпустил короткую очередь в сторону эксперта. К счастью, последний участвовал в передаче удалённо, поэтому пострадал только экран с его изображением.

В свою очередь ещё один гость произвел два ответных выстрела в ведущего из пистолета. Позже он объяснил это привычкой, выработавшейся за многие десятилетия «плотного взаимодействия с партнёрами из Североатлантического альянса». Часть экспертов к тому моменту уже выбрали себе укрытия и начали вести из них хаотичный огонь. В результате один человек пострадал – у него касательное ранение ноги.

«Мой афганский коллега не знал, что у нас это все не по-настоящему и обычно заканчивается банальной дракой с минимум крови, – комментирует инцидент Владимир Соловьёв. – Здесь же имели место национальные особенности телевидения и небольшая импровизация»

Бом в свою очередь заявил, что решил отказаться от приглашения лично посетить афганскую передачу, учитывая опыт дистанционного участия и тот факт, что его медицинская страховка не рассчитана на подобные горячие дебаты.

* организация внесена в список террористических.`,
    created: '2022-10-23T14:47:20.777Z',
    updated: '2022-10-23T14:47:20.777Z',
    promo: true,
    views: 94,
    likes: 10,
    image: 'https://panorama.pub/storage/images/90/89/c82d5a671cc3758596b003e79d26/previews/15081-main.jpg.webp',
  },
  {
    uuid: 'eer1qw23-72de-4c87-b2d5-cdc6c72d59d4',
    title: 'Единственный шанс покинуть город: эксперты объяснили успех мобилизации в Омске',
    body: `Омск стал одним из лидеров по количеству добровольцев в ходе частичной мобилизации и занял первое место среди российских городов-миллионников. По мнению экспертов, горожан совершенно не напугала перспектива покинуть родные пенаты, а многих наоборот подстегнула.

«Иногда приходили даже люди, которых мы не могли призвать: инвалиды, многодетные отцы, женщины, несовершеннолетние. Программисты увольнялись с работы. Ещё один момент – никто из них не жаловался ни на условия содержания, ни возражал против отправки хоть в Магадан, хоть на границу с Казахстаном, некоторые даже готовы были ехать в Африку», – сообщил военком.

Своим мнением об успешности мобилизационных мероприятий поделились и социологи.

«Омичи давно ждали возможности вырваться из города, мобилизация – самый верный шаг в этом направлении. В Омске она была заранее обречена на успех – многие, кто не попал в первую волну, искренне надеются на вторую, третью, пятидесятую волны», – рассказала директор Омского международного института социологии Ирина Васильева.

Она добавила, что в будущем омским властям предстоит решить более тяжёлую задачу – разработать эффективные механизмы по возвращению горожан. `,
    created: '2022-10-23T19:47:20.777Z',
    updated: '2022-10-23T19:47:20.777Z',
    promo: true,
    views: 76,
    likes: 4,
    image: 'https://panorama.pub/storage/images/bc/3f/71abc7efc24e77ebf953ea90ad78/previews/15062-main.jpg.webp',
  },
];
/* eslint-enable max-len */
