/* eslint-disable max-len */
import { PostDto } from '@angular-samples/redux/posts/common';

/**
 * @description Default posts for demonstration
 */
export const POSTS_DEFAULT: PostDto[] = [
  {
    uuid: '002a649b-72de-4c87-b2d5-cdc6c72d59d4',
    title: 'Иран закупит 1500 российских беспилотников «Герань-2»',
    body: `Власти Ирана заключили с Москвой сделку на поставку 1500 российских беспилотных аппаратов «Герань-2». Как сообщает газета The Washington Post, ссылаясь на собственные высокопоставленные источники в иранском министерстве обороны, первые поставки начнутся уже в ближайшие месяцы.
Собеседник утверждает, что иранские военные восхищены качеством аппарата, название которого по счастливой случайности созвучно с именем их страны. Исламская Республика не будет публично объявлять о контракте, чтобы не облегчать для Запада введение новых санкций, однако недавно заместитель председателя комитета по обороне Махмуд Фарахани в эфире национального телевидения случайно проговорился о поставках.

«Давайте не будем раскачивать лодку и распространяться насчёт этих дронов... Все знают, что они русские, но власти не признают», – сказал он, посчитав, что эфир ещё не начался.

Также западные СМИ утверждают, что Иран надеется наладить производство «Герани-2» по лицензии. Неизвестно, какая доля локализации намечена и как к этому относятся в российском ОПК.`,
    created: '2022-10-23T13:47:20.777Z',
    updated: '2022-10-23T13:47:20.777Z',
    promo: true,
    views: 100,
    likes: 1,
    image: 'https://panorama.pub/storage/images/35/ed/ba2d4e54dadc90c4a20025c669a0/previews/15082-main.jpg.webp',
  },
  {
    uuid: '77wask00-71de-4c87-b2d5-asc6c72d59d4',
    title: 'Первое в Афганистане политическое ток-шоу по российской лицензии закончилось перестрелкой',
    body: `Во время первого же эфира лицензионного ток-шоу «Вечерний Талибан*», транслировавшегося на общенациональном канале «Афганистан 1», произошла перестрелка. Гости студии не сошлись во мнениях насчёт нынешнего положения дел в стране и её новейшей истории.

Западный политолог Майкл Бом высказал мнение о том, что Джо Байдену следовало не выводить войска из Афганистана, а продлить их пребывание ещё на десять лет. Высказывание американца привело в ярость телеведущего Мохамеда Багдади Аль-Бахрави, который достал автомат Калашникова и выпустил короткую очередь в сторону эксперта. К счастью, последний участвовал в передаче удалённо, поэтому пострадал только экран с его изображением.

В свою очередь ещё один гость произвел два ответных выстрела в ведущего из пистолета. Позже он объяснил это привычкой, выработавшейся за многие десятилетия «плотного взаимодействия с партнёрами из Североатлантического альянса». Часть экспертов к тому моменту уже выбрали себе укрытия и начали вести из них хаотичный огонь. В результате один человек пострадал – у него касательное ранение ноги.

«Мой афганский коллега не знал, что у нас это все не по-настоящему и обычно заканчивается банальной дракой с минимум крови, – комментирует инцидент Владимир Соловьёв. – Здесь же имели место национальные особенности телевидения и небольшая импровизация»

Бом в свою очередь заявил, что решил отказаться от приглашения лично посетить афганскую передачу, учитывая опыт дистанционного участия и тот факт, что его медицинская страховка не рассчитана на подобные горячие дебаты.

* организация внесена в список террористических.`,
    created: '2022-10-23T14:47:20.777Z',
    updated: '2022-10-23T14:47:20.777Z',
    promo: true,
    views: 94,
    likes: 10,
    image: 'https://panorama.pub/storage/images/90/89/c82d5a671cc3758596b003e79d26/previews/15081-main.jpg.webp',
  },
  {
    uuid: 'eer1qw23-72de-4c87-b2d5-cdc6c72d59d4',
    title: 'Единственный шанс покинуть город: эксперты объяснили успех мобилизации в Омске',
    body: `Омск стал одним из лидеров по количеству добровольцев в ходе частичной мобилизации и занял первое место среди российских городов-миллионников. По мнению экспертов, горожан совершенно не напугала перспектива покинуть родные пенаты, а многих наоборот подстегнула.

«Иногда приходили даже люди, которых мы не могли призвать: инвалиды, многодетные отцы, женщины, несовершеннолетние. Программисты увольнялись с работы. Ещё один момент – никто из них не жаловался ни на условия содержания, ни возражал против отправки хоть в Магадан, хоть на границу с Казахстаном, некоторые даже готовы были ехать в Африку», – сообщил военком.

Своим мнением об успешности мобилизационных мероприятий поделились и социологи.

«Омичи давно ждали возможности вырваться из города, мобилизация – самый верный шаг в этом направлении. В Омске она была заранее обречена на успех – многие, кто не попал в первую волну, искренне надеются на вторую, третью, пятидесятую волны», – рассказала директор Омского международного института социологии Ирина Васильева.

Она добавила, что в будущем омским властям предстоит решить более тяжёлую задачу – разработать эффективные механизмы по возвращению горожан. `,
    created: '2022-10-23T19:47:20.777Z',
    updated: '2022-10-23T19:47:20.777Z',
    promo: true,
    views: 76,
    likes: 4,
    image: 'https://panorama.pub/storage/images/bc/3f/71abc7efc24e77ebf953ea90ad78/previews/15062-main.jpg.webp',
  },
  {
    uuid: '442a649b-72de-4c87-c2c5-cdc6c72d59d4',
    title: 'Риши Сунак запросил у парламента 7 млрд фунтов на введение кастовой системы',
    body: `Премьер-министр Великобритании Риши Сунак обратился к Палате общин с требованием предоставить в распоряжение своего кабмина 7 млрд фунтов стерлингов для создания в стране кастовой системы, аналогичной тем, что действуют в Индии и Пакистане. По его утверждению, все невзгоды Соединённого королевства проистекают из того, что люди не следуют своей варне.

Согласно проекту, представленному Сунаком, к 2024 году каждый житель Великобритании вместе с нисходящим потомством должен быть определён к одной из четырёх варн – браминов, кшатриев, вайшьев или шудр. Профессиональные и должностные обязанности людей должны строго соотноситься с их кастовой принадлежностью: так, шудре не место в правительстве, а брамина никто не вправе заставить мести улицы или заниматься физическим трудом.

Также запрещены будут браки вне своей варны, что положит конец сексуальной распущенности, разлагающей британское общество. По мнению премьер-министра, все эти меры позволят создать в Великобритании порядок, который поможет ей устоять «во времена гнева Шивы».

«Предыдущие два премьера были отъявленными шудрами из касты неприкасаемых, и посмотрите, чем это кончилось. Вы (англичане– прим.) назначаете кого попало на те места, которые не были им предопределены богами. В результате у вас премьер-министром может стать клинический идиот или даже идиотка, – заявил Сунак. – Кто вообще придумал женщину в парламент пускать? У нас за попытку заниматься политической деятельностью браминке обривают голову, а кшатрийке отрезают два пальца. Я покажу вам настоящий порядок. А тех, кто будет стоять на моём пути, поглотит карающее пламя господа Индры»`,
    created: '2022-07-22T13:47:20.777Z',
    updated: '2022-07-23T13:47:20.777Z',
    promo: false,
    views: 2030,
    likes: 503,
    image: 'https://panorama.pub/storage/images/dd/82/cb56d981fb50825e5b7363255fa6/previews/15146-main.jpg.webp',
  },
  {
    uuid: '552a111b-72de-4c87-c2c5-cdc6c72d59d4',
    title: 'Символ культурного кода: штрафы за русский мат в общественных местах решили отменить',
    body: `В Госдуму поступил документ с результатами экспертизы возникновения и лексического применения русского мата, проведённой Институтом русского языка им. В. В. Виноградова РАН. Изучив многолетние исследования своих коллег и соцопросы ВЦИОМ, учёные пришли к выводу, что подавляющее большинство россиян вне зависимости от национальности и вероисповедания остро нуждаются в использовании русских нецензурных слов для коммуникации.

В заключении говорится, что русский мат является «неотъемлемой частью культурного кода многонационального российского народа», он широко применяется как в профессиональной, так и в бытовой сферах. Обсценная лексика не может быть заменена цензурными синонимами с сохранением всего спектра передаваемых значений.

Эксперты рекомендовали депутатам принять закон об отмене ограничений на использование русского мата в искусстве, СМИ и общественных местах, а также изъять из Кодекса РФ об административных правонарушениях статью 20.1, согласно которой публичная нецензурная брань приравнивается к мелкому хулиганству. Россияне должны иметь право свободно применять «элементы и символы национального культурного кода в повседневной речи». Вместе с этим филологи рекомендовали увеличить штрафы для граждан, которые матерятся на иностранных языках.

В парламенте положительно оценили выводы экспертов.

«У нас в Думе были острые дискуссии по этому вопросу, зачастую с употреблением этих слов. Раз учёные сделали соответствующие выводы, не доверять им мы не вправе. Теперь я смогу более конструктивно дискутировать с коллегами. О....еть!», – прокомментировал рекомендации экспертов депутат Василий Ершов.
`,
    created: '2022-07-29T13:47:20.777Z',
    updated: '2022-07-29T13:47:20.777Z',
    promo: false,
    views: 2022,
    likes: 454,
    image: 'https://panorama.pub/storage/images/f2/5a/92dbd64abb30ba22239602f4d930/previews/15145-main.jpg.webp',
  },
  {
    uuid: '652a111b-72de-4c87-c2c5-cdc6c72d59se',
    title: 'Из сотни людей, пишущих в интернете про «жертв ЕГЭ», сдать этот экзамен смогли двое',
    body: `Один из частных образовательных центров в Москве провёл эксперимент: он пригласил людей, которые пишут в сети про «жертв ЕГЭ» и «лучшее советское образование», самим сдать Единый государственный экзамен. В результате лишь 2 человека из 100 экзаменуемых смогли набрать необходимый минимум баллов.

Самой сложной задачей оказался набор людей. За участие в неофициальном ЕГЭ пенсионерам предлагали заплатить по 5000 рублей, работающим россиянам – зарплату за два их рабочих дня. Однако на практике большинство критиков ЕГЭ оказались безработными, а те, кто всё же был трудоустроен, заявили, что «за такие копейки» ничего делать не намерены.

Когда всё уже удалось набрать сто экзаменуемых, организаторы столкнулись с другой проблемой: даже во время пробной сдачи большинство «студентов» пытались списывать. Когда им объясняли, что списывать нельзя (и это было прописано в договоре об участии в эксперименте), они обижались и заявляли, что секрет успеха советского человека заключается именно в «смекалочке», а не в «ботанской зубрёжке».

В итоге экзамен всё же удалось провести с третьей попытки. Оказалось, что лишь два человека из сотни набрали необходимые минимумы баллов по двум основным предметам: русскому языку и математике. По отдельным экзаменам результаты таковы: одну только математику сдали 14 человек, а один только русский язык – 12 человек. Организаторы также выяснили, что среди экзаменуемых были трое действующих школьных педагогов и двое бывших, а также один бывший преподаватель вуза. Свои провальные результаты большинство объяснили «идиотскими заданиями», плохой памятью, плохим самочувствием, неудачным днём с точки зрения гороскопа. Один человек сослался на головную боль из-за «зомбирующих лучей 5G».`,
    created: '2022-07-30T13:47:20.777Z',
    updated: '2022-07-30T13:47:20.777Z',
    promo: false,
    views: 2011,
    likes: 203,
    image: 'https://panorama.pub/storage/images/14/15/cf7c5a883c8ed49729e335ca9527/previews/15141-main.jpg.webp',
  },
  {
    uuid: '112a524b-55de-3c87-c2c5-cdc6c72d59d4',
    title: 'Конгресс США распространил действие требований Национальной киноакадемии на весь мир',
    body: `Американской Конгресс принял федеральный закон об экстерриториальном действии требований Академии кинематографических искусств и наук США. Это значит, что их действие с сегодняшнего дня распространяется не только на ленты, которые снимаются в Соединённых Штатах или претендуют на прокат в этой стране, но и на любые фильмы, снимаемые киностудиями по всему миру.

Закон был принят с минимальным перевесом голосов (большинство республиканцев высказались против), что теоретически даёт Белому дому шанс его ветировать. Однако в администрации Байдена заверили, что не будут пользоваться таким правом – речь идёт о «необходимой норме, которая позволит привести мировой кинематограф в соответствие с современными стандартами», считают там.

На практике документ означает, что американские власти смогут экстрадировать и судить любого режиссёра, продюсера или члена съёмочной группы, который имеет отношение к съёмке и показу лент, не соответствующих нормативам, принятым в Нью-Йорке. Самих требований на данный момент насчитывается свыше двух тысяч – они касаются в первую очередь состава персонажей, их роли в сюжете, поведения, соответствия или несоответствия стереотипам, кастинга актёров и так далее.
`,
    created: '2022-08-11T13:47:20.777Z',
    updated: '2022-08-11T13:47:20.777Z',
    promo: false,
    views: 1999,
    likes: 665,
    image: 'https://panorama.pub/storage/images/3e/51/b2b52ac1c1adbd3362f245f350fe/previews/15140-main.jpg.webp',
  },
  {
    uuid: '442a332b-11de-1c87-w1c5-cdc6c72d59d4',
    title: 'У спящих пассажиров поездов не будут проверять билеты',
    body: `Руководство РЖД разработало поправки к внутренним регламентам, согласно которым контролёры и проводники больше не смогут будить спящих пассажиров в вагонах электричек и обычных поездов с целью проверки проездных билетов. Кроме того, предполагается ввести штраф в размере 500 рублей для «имитирующих сон в целях бесплатного проезда».

Нововведения объясняют тем, что контролеры зачастую будят людей, уставших после рабочей смены

«Контролёры и проводники отвлекают от заслуженного отдыха просто для того, чтобы посмотреть билет. Знаете, это очень неприятно, – говорит глава РЖД Олег Белозёров. – Ехал я как-то в Петербурге от станции Ораниенбаум до Балтийского вокзала, задремал. Чувствую, кто-то трясет. Сначала подумал, может с поездом что? Или кто под рельсы попал, животное, человек там – такое часто бывает. А это контролёр меня будит и просит билет, представляете? Это неправильно. Такого быть не должно».
`,
    created: '2022-08-13T13:47:20.777Z',
    updated: '2022-08-13T13:47:20.777Z',
    promo: false,
    views: 1882,
    likes: 321,
    image: 'https://panorama.pub/storage/images/e9/2d/5f9ccdf47c409de2105770708df0/previews/15139-main.jpg.webp',
  },
  {
    uuid: '512a111b-99de-9c87-c2c5-cdc6c72d21d4',
    title: '«Фандорина придумал я, запрещать его не надо»: Прилепин заявил, что является автором «Азазеля» и «Турецкого гамбита»',
    body: `Российский публицист и депутат Государственной думы Евгений (Захар) Прилепин в эфире телепередачи «Уроки русского» подтвердил, что именно он 25 лет назад создал литературного героя Эраста Фандорина. Из-за тяжёлого финансового положения в 1998 году он был вынужден продать рукопись писателю Борису Акунину, который опубликовал роман под своим именем.

«После дефолта денег у меня не было вообще, а Акунин согласился не только заплатить за рукопись, но и оперативно её издать. Поэтому Фандорина запрещать нельзя, его придумал я, он настоящий русский патриот», — рассказал Прилепин.

Прилепин представил доказательства того, что именно он является автором романов «Азазель», «Турецкий гамбит» и «Левиафан» – в прямом эфире писатель продемонстрировал запечатанные письма с рукописью, которые он отправил сам себе накануне сделки с Акуниными. Почтовые штампы подтверждают, что депутат имел доступ к рукописи до её публикации.

В ближайшее время Прилепин планирует обратиться в суд для восстановления авторских прав.`,
    created: '2022-08-19T13:47:20.777Z',
    updated: '2022-08-19T13:47:20.777Z',
    promo: false,
    views: 1775,
    likes: 125,
    image: 'https://panorama.pub/storage/images/de/da/f2421fb78b946d83d8efded41d5c/previews/15120-main.jpeg.webp',
  },
  {
    uuid: '123a111b-12de-2e87-c2c5-cdc6c72d1112',
    title: 'Для вступления в должность премьер-министра Великобритании соискателям придется пройти испытательный срок',
    body: `В понедельник 24 сентября Палата общин рассмотрит законопроект, предусматривающий введение испытательного срока для соискателей на должность премьер-министра Великобритании, сообщает The Guardian.

Последние события в политике Туманного Альбиона побудили парламентариев предпринять решительные меры по оптимизации государственного устройства. По словам источника издания, все стороны сошлись в необходимости преодолеть нынешнюю текучку кадров в высшем руководстве страны.

Готовящийся закон не позволит будущим главам кабмина самостоятельно отказываться от полномочий в течение полугода после вступления на должность. В свою очередь члены кабинета министров, назначенные главой правительства, не смогут покинуть свои посты весь последующий год. Поправка на высшее или среднее образование, при условии его наличия у премьера или министров, не предусмотрена.

Специалисты белорусского Фонда по борьбе с демократией назвали «вопиющим» сам факт трёхкратной смены правящей элиты британского общества за последние 4 года и предложили свою посильную помощь коллегам в установлении прочной и стабильной политической власти в стране.
`,
    created: '2022-08-28T13:47:20.777Z',
    updated: '2022-08-28T13:47:20.777Z',
    promo: false,
    views: 1654,
    likes: 165,
    image: 'https://panorama.pub/storage/images/c2/e4/e9cdb6fb6ce4149b6aa9725febd6/previews/15109-main.jpg.webp',
  },
  {
    uuid: '772a111b-77de-4c87-c2c5-cdc6c72der3',
    title: 'Тбилиси обогнал Лос-Анджелес по стоимости аренды жилья',
    body: `Агентства, исследующие тенденции в экономической сфере и на рынке недвижимости, констатировали рекордный рост цен на арендное жилье в Тбилиси: они не только обновили исторический максимум, но и превысили его в 62 раза.

По словам одного из экспертов, это связано с эффективной экономической политикой Грузии, направленной на поиск иностранных инвестиций и способствующей развитию потенциала населения. Средний уровень образованности грузин показал 2,5 кратный рост, а число IT-специалистов на душу населения и вовсе увеличилось на порядок – в 12,4 раза.

В настоящий момент цены на аренду жилых помещений в Тбилиси уже превысили показатели Лос-Анджелеса и приближаются к уровню Йью-Йорка и Сан-Франциско. Не исключено, что это ещё не предел – хотя рынок явно «перегрет», люди продолжают заключать даже долгосрочные контракты по нынешним баснословным ценам.`,
    created: '2022-09-01T13:47:20.777Z',
    updated: '2022-09-01T13:47:20.777Z',
    promo: false,
    views: 1443,
    likes: 144,
    image: 'https://panorama.pub/storage/images/3f/6c/6487a4ef058ee1b98d3bf05162cc/previews/15110-main.jpg.webp',
  },
  {
    uuid: '543a111b-72de-4c87-c2c5-cdc6c72d5432',
    title: 'Немецкий доктор рассказал о пользе лечебного холодания',
    body: `Доктор медицины Август фон Богенборг выступил в Кёльнском университете с лекцией о пользе лечебного холодания при онкологических болезнях, депрессии и гипертонии. По словам учёного, охлаждение температуры тела до 25 градусов исключает риск смерти от целого ряда болезней.

Так, по данным исследований, проведённых профессором, из 100 пациентов, температура тела которых была доведена до 25 градусов Цельсия, смертность от рака и гипертонии составила 0%. Также, спустя 30 минут после начала эксперимента, ни один пациент не жаловался на усталость, головные боли, депрессию и плоскостопие.

Доктор фон Богенберг считает, что будущей зимой Германия сможет стать мировым лидером в лечении целого ряда болезней, и поддержал действующий курс правительства на отказ от использования топлива с целью спасения экологии. Учёный отметил, что при полном запрете на сжигание топлива к концу зимы в Германии не останется ни одного гипертоника и онкобольного.

«Первые эксперименты в области лечебного холодания велись в 40-х, в них принимал участие мой дедушка, стоявший у истоков этой науки. Думаю, в ближайшее время всем немцам предстоит ощутить на себе чудодейственный лечебный эффект его методики. Для этого вовсе не обязательно ехать в стационар лагерного типа, проходить холодотерапию можно прямо у себя дома. Для этого достаточно отказаться от горючего топлива, которое при сгорании выделяет вредный углекислый газ, и сосредоточиться на солнцеедении и вегетарианском питании», - рассказал Август фон Богенберг.`,
    created: '2022-09-29T13:47:20.777Z',
    updated: '2022-09-29T13:47:20.777Z',
    promo: false,
    views: 1221,
    likes: 43,
    image: 'https://panorama.pub/storage/images/8d/8e/5b46f41052ba87466f3a56ee0585/previews/14896-main.jpg.webp',
  },
];
/* eslint-enable max-len */
